<?php

return [
    /*
    |--------------------------------------------------------------------------
    | Exceptions
    |--------------------------------------------------------------------------
    |
    | Содержит все исключения, которые могут возникать при использовании класса.
    |
    */
    'requested_value_not_available' => 'Запрошенное значение не существует!',
    'autobackup_wrong_value'        => 'Эта функция может принимать только значения true или false!',
    'requested_backup_not_found'    => 'Запрашиваемая резервная копия не существует!',
    'no_backups_available'          => 'Нет ни одной резервной копии!',
    'backup_not_deletable'          => 'Резервная копия не может быть удалена, так как файл не был найден!',
    'array_needed'                  => 'Функция может принимать только массив!',
    'numeric_array_needed'          => 'Функция может принимать только цифровой массив, содержащий только ключи для удаления!'
];
